krayon/pinball-OPP/Stm32Workbench/OppGen3/Src/Common/digital.c
      /* If a matrix wing exists, set up the solenoid inputs */
      if ((gen2g_info.typeWingBrds & (1 << WING_SW_MATRIX_IN)) != 0)
      {
         /* Grab mtrxWaitCntThresh from config if set */
         if (gen2g_info.inpCfg_p->inpCfg[RS232I_MTRX_WAIT_THRESH_INDX] == 0)
         {
            dig_info.mtrxData.mtrxWaitCntThresh = MATRIX_WAIT_CNT_THRESH;
         }
         else
         {
            dig_info.mtrxData.mtrxWaitCntThresh = gen2g_info.inpCfg_p->inpCfg[RS232I_MTRX_WAIT_THRESH_INDX];
         }

         /* Grab mtrxDebounceThresh from config if set */
         if (gen2g_info.inpCfg_p->inpCfg[RS232I_MTRX_DEBOUNCE_THRESH_INDX] == 0)
         {
            dig_info.mtrxData.mtrxDebounceThresh = MATRIX_DEBOUNCE_THRESH;
         }
         else
         {
            dig_info.mtrxData.mtrxDebounceThresh = gen2g_info.inpCfg_p->inpCfg[RS232I_MTRX_DEBOUNCE_THRESH_INDX];
         }


         /* Initialize the counts and solenoid info */
         for (index = 0; index < RS232I_SW_MATRX_INP; index++)
         {
            dig_info.mtrxData.info[index].cnt = 0;
            dig_info.mtrxData.info[index].sol = 0;
         }
         /* Set up the solenoids to autofire using the switch matrix */
         for (index = 0, solCfg_p = &gen2g_info.solDrvCfg_p->solCfg[0];
            index < RS232I_NUM_GEN2_SOL; index++, solCfg_p++)
         {
            if (solCfg_p->cfg & USE_MATRIX_INP)
            {
               dig_info.mtrxData.info[solCfg_p->minOffDuty].sol = MATRIX_FIRE_SOL | index;
            }
         }
         /* Initialize matrix input for rs232 reports */
         for (index = 0; index < RS232I_MATRX_COL; index++)
         {
            if (gen2g_info.switchMtrxActHigh)
            {
               gen2g_info.matrixInp[index] = 0;
            }
            else
            {
               gen2g_info.matrixInp[index] = 0xff;
            }
         }
      }
      
      /* Set up the initial state */
      digital_upd_sol_cfg((1 << RS232I_NUM_GEN2_SOL) - 1);
      digital_upd_inp_cfg(dig_info.inpMask);
   }

} /* End digital_init */

/*
 * ===============================================================================
 * 
 * Name: digital_task
 * 
 * ===============================================================================
 */
/**
 * Task for polling inputs
 * 
 * @param   None 
 * @return  None
 * 
 * @pre     None 
 * @note    None
 * 
 * ===============================================================================
 */
void digital_task(void)
{
   DIG_INP_STATE_T            *inpState_p;
   DIG_SOL_STATE_T            *solState_p;
   RS232I_SOL_CFG_T           *solCfg_p;
   DIG_MTRX_BIT_INFO_T        *matrixBitInfo_p;
   U32                        inputs = 0;
   U32                        changedBits;
   U32                        updFilterHi;
   U32                        updFilterLow = 0;
   INT                        index;
   U8                         data;
   U8                         chngU8;
   RS232I_CFG_INP_TYPE_E      cfg;
   U32                        currBit;
   INT                        elapsedTimeMs;

#define SWITCH_THRESH         16
#define PWM_PERIOD            16
#define MIN_OFF_INC           0x10
   
   if (gen2g_info.validCfg)
   {
      /* Grab the inputs */
      inputs = stdldigio_read_all_ports(dig_info.inpMask);
      if ((gen2g_info.typeWingBrds & ((1 << WING_INP) | (1 << WING_SOL))) != 0)
      {
         /* See what bits have changed */
         changedBits = (dig_info.prevInputs ^ inputs) & dig_info.inpMask;
         updFilterHi = 0;
         updFilterLow = 0;
         
         /* Perform input processing for both input and solenoid boards */
         for (index = 0, currBit = 1, inpState_p = &dig_info.inpState[0];
            index < RS232I_NUM_GEN2_INP; index++, currBit <<= 1, inpState_p++)
         {
            if (currBit & dig_info.inpMask)
            {
               /* Check if this count has changed */
               if (changedBits & currBit)
               {
                  inpState_p->cnt = 0;
               }
               else
               {
                  if (inpState_p->cnt <= SWITCH_THRESH)
                  {
                     inpState_p->cnt++;
                  }
                  if (inpState_p->cnt == SWITCH_THRESH)
                  {
                     cfg = gen2g_info.inpCfg_p->inpCfg[index];
                     if (inputs & currBit)
                     {
                        updFilterHi |= currBit;
                        dig_info.filtInputs |= currBit;
                        if (cfg == RISE_EDGE)
                        {
                           DisableInterrupts;
                           gen2g_info.validSwitch |= currBit;
                           EnableInterrupts;
                           gen2g_info.inpTimestamp[index] = (U16)timer_get_ms_count();
                        }
                     }
                     else
                     {
                        updFilterLow |= currBit;
                        dig_info.filtInputs &= ~currBit;
                        if (cfg == FALL_EDGE)
                        {
                           DisableInterrupts;
                           gen2g_info.validSwitch |= currBit;
                           EnableInterrupts;
                           gen2g_info.inpTimestamp[index] = (U16)timer_get_ms_count();
                        }
                     }
                  }
               }
            }
         }
      }

      if ((gen2g_info.typeWingBrds & (1 << WING_SW_MATRIX_IN)) != 0)
      {
         if (dig_info.mtrxData.waitCnt >= dig_info.mtrxData.mtrxWaitCntThresh)
         {
        	dig_info.mtrxData.waitCnt = 0;
    	    data = (U8)(stdldigio_read_all_ports(dig_info.mtrxInpMask) >> 24);
            chngU8 = data ^ gen2g_info.matrixPrev[dig_info.mtrxData.column];
            gen2g_info.matrixPrev[dig_info.mtrxData.column] = data;
            matrixBitInfo_p = &dig_info.mtrxData.info[dig_info.mtrxData.column * 8];
            for (index = 0, currBit = 1; index < 8; index++, currBit <<= 1, matrixBitInfo_p++)
            {
               /* If bit has changed, reset count */
               if ((currBit & chngU8) != 0)
               {
                  matrixBitInfo_p->cnt = 0;
               }
               else
               {
                  if (matrixBitInfo_p->cnt <= dig_info.mtrxData.mtrxDebounceThresh)
                  {
                     matrixBitInfo_p->cnt++;
                  }
                  /* Just passed the threshold so update data bit */
                  if (matrixBitInfo_p->cnt == dig_info.mtrxData.mtrxDebounceThresh)
                  {
                     if (((data & currBit) && gen2g_info.switchMtrxActHigh) ||
                       (((data & currBit) == 0) && !gen2g_info.switchMtrxActHigh))
                     {
                        /* Set or clear bit depending if active high or low */
                        if (gen2g_info.switchMtrxActHigh)
                        {
                           gen2g_info.matrixInp[dig_info.mtrxData.column] |= currBit;
                        }
                        else
                        {
                           gen2g_info.matrixInp[dig_info.mtrxData.column] &= ~currBit;
                        }
                        if (matrixBitInfo_p->sol != 0)
                        {
                           gen2g_info.solDrvProcCtl |=
                              (1 << (matrixBitInfo_p->sol & MATRIX_SOL_MASK));
                        }
                     }
                  }
               }
            }
         }

         if (dig_info.mtrxData.waitCnt == 0)
         {
            /* Move to next column */
            dig_info.mtrxData.column++;
            if (dig_info.mtrxData.column >= RS232I_MATRX_COL)
            {
               dig_info.mtrxData.column = 0;
            }
         
#if GEN2G_DEBUG_PORT == 0
            dig_info.outputMask |= MTRX_OUTPUT_BIT_MASK;
#else
            dig_info.outputMask |= DBG_MTRX_OUT_BIT_MASK;
#endif
            /* Reverse column numbering to match Bally documentation */
            if (gen2g_info.switchMtrxActHigh)
            {
               dig_info.outputUpd |= (1 << (MATRIX_COL_OFFS + RS232I_MATRX_COL - 1 - dig_info.mtrxData.column));
            }
            else
            {
               dig_info.outputUpd |= ((~(1 << (MATRIX_COL_OFFS + RS232I_MATRX_COL - 1 - dig_info.mtrxData.column))) &
                  MATRIX_COL_MASK);
            }
         }
         dig_info.mtrxData.waitCnt++;
      }
      
      if ((gen2g_info.typeWingBrds & (1 << WING_SOL)) != 0)
      {
        /* Perform solenoid processing */
         for (index = 0, currBit = 1, solState_p = &dig_info.solState[0],
            solCfg_p = &gen2g_info.solDrvCfg_p->solCfg[0];
            index < RS232I_NUM_GEN2_SOL; index++, currBit <<= 1, solState_p++, solCfg_p++)
         {
            /* Check if processor is requesting a kick, or an input changed */
            if ((solState_p->solState == SOL_STATE_IDLE) &&
               ((gen2g_info.solDrvProcCtl & currBit) ||
               (updFilterLow & solState_p->inpBits)))
            {
               /* Check if processor is kicking normal solenoid */
               if ((solCfg_p->cfg & (ON_OFF_SOL | DLY_KICK_SOL)) == 0)
               {
                  /* Start the solenoid kick */
                  solState_p->solState = SOL_INITIAL_KICK;
                  solState_p->startMs = timer_get_ms_count();
                  dig_info.outputMask |= solState_p->bit;
                  dig_info.outputUpd |= solState_p->bit;
               }
               else if ((solCfg_p->cfg & ON_OFF_SOL) != 0)
               {
                  solState_p->solState = SOL_FULL_ON_SOLENOID;
                  dig_info.outputMask |= solState_p->bit;
                  dig_info.outputUpd |= solState_p->bit;
               }
               else if ((solCfg_p->cfg & DLY_KICK_SOL) != 0)
               {
                  solState_p->solState = SOL_WAIT_BEFORE_KICK;
                  solState_p->startMs = timer_get_ms_count();
               }
               if ((solCfg_p->cfg & AUTO_CLR) &&
                  (gen2g_info.solDrvProcCtl & currBit))
               {
                  gen2g_info.solDrvProcCtl &= ~currBit;
                  solState_p->clearRcvd = TRUE;
               }
               else
               {
                  solState_p->clearRcvd = FALSE;
               }
            }
            else if (solState_p->solState == SOL_INITIAL_KICK)
            {
               if ((solCfg_p->cfg & CAN_CANCEL) != 0)
               {
                   if (((gen2g_info.solDrvProcCtl & currBit) == 0) &&
    			     ((solState_p->inpBits == 0) ||
                     ((solState_p->inpBits & inputs) == solState_p->inpBits)))
                   {
                      /* Switch is inactive, turn off drive signal */
                      dig_info.outputMask |= solState_p->bit;
                      solState_p->solState = SOL_STATE_IDLE;
                   }
               }
            
